---
type: FilledRegionType
namespace: Autodesk.Revit.DB
version: 2024
members: 13
tags: [revit-api, class]
---

# FilledRegionType

`Autodesk.Revit.DB.FilledRegionType` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsValidBackgroundPatternId | 2024 | `public bool IsValidBackgroundPatternId ( ElementId patternId )` |
| Method | IsValidFillPatternId | 2024 | `public bool IsValidFillPatternId ( ElementId patternId )` |
| Method | IsValidForegroundPatternId | 2024 | `public bool IsValidForegroundPatternId ( ElementId patternId )` |
| Method | IsValidLineWeight | 2013 | `public static bool IsValidLineWeight ( int lineWeight )` |
| Method | IsValidMasking | 2024 | `public bool IsValidMasking ( bool isMasking )` |
| Method | IsValidSolidFillPatternId | 2024 | `public bool IsValidSolidFillPatternId ( ElementId patternId )` |
| Property | BackgroundPatternColor | 2019 | `public Color BackgroundPatternColor { get ; set ; }` |
| Property | BackgroundPatternId | 2019 | `public ElementId BackgroundPatternId { get ; set ; }` |
| Property | ForegroundPatternColor | 2019 | `public Color ForegroundPatternColor { get ; set ; }` |
| Property | ForegroundPatternId | 2019 | `public ElementId ForegroundPatternId { get ; set ; }` |
| Property | IsMasking | 2019 | `public bool IsMasking { get ; set ; }` |
| Property | LineWeight | 2013 | `public int LineWeight { get ; set ; }` |
| Property | Parameter | — | `` |